Repository: rajlal/FunWithSilverlight
Catalog: Chapter10/C#/Project/AdvancedMedia/1-AdvanceMedia/AdvMediaPlayer.Web/EncoderMedia/MediaPlayer/Resources/Resources.*.resx
Languages: es, fr, it, ko

# ArgumentException
source: Expected an instance of TimeCode.
es: Se esperaba una instancia de TimeCode.
fr: Instance de TimeCode attendue.
it: Prevista un'istanza di TimeCode.
ko: TimeCode가 있어야 합니다.

# errorNonSmoothStreamingServer
source: {0}. Requires output to be hosted on a web server running IIS 7.0 with the Smooth Streaming handler installed and a Silverlight template that supports Smooth Streaming.
es: {0}. La salida debe estar hospedada en un servidor IIS 7.0 con el controlador de transmisión por secuencias suave instalado y una plantilla de Silverlight compatible con la transmisión de secuencias suave.
fr: {0}. Nécessite que la sortie soit hébergée sur un serveur Web exécutant IIS 7.0 avec le gestionnaire de diffusion en continu lisse installé et un modèle Silverlight qui prend en charge la diffusion en continu lisse.
it: {0}. È necessario che l'output venga ospitato in un server Web che esegue IIS7 con il gestore per i flussi uniformi installato e un modello di Silverlight 2 che supporta i flussi uniformi.
ko: {0}. 출력은 IIS 7.0을 실행하는 웹 서버에서 호스팅되어야 하며, 웹 서버에는 부드러운 스트리밍 처리기가 설치되어 있고 부드러운 스트리밍 기능을 지원하는 Silverlight 템플릿이 있어야 합니다

# Smpte12MBadFormat
source: The timecode provided is not in the correct format.
es: El código de tiempo proporcionado no tiene el formato correcto.
fr: Le code horaire fourni ne figure pas dans le format correct.
it: Il formato del timecode non è corretto.
ko: 지정한 시간 코드가 올바른 형식이 아닙니다.

# Smpte12MOutOfRange
source: The timecode provided is out of the expected range.
es: El código de tiempo proporcionado está fuera del intervalo esperado.
fr: Le code horaire fourni ne figure pas dans l'intervalle attendu.
it: Il timecode fornito non è compreso nell'intervallo previsto.
ko: 지정한 시간 코드가 범위를 벗어납니다.

# Smpte12MOverflowException
source: The resulting timecode is out of the expected range of MaxValue.
es: El código de tiempo resultante está fuera del intervalo esperado de MaxValue.
fr: Le code horaire résultant se trouve en dehors de l'intervalle attendu pour MaxValue.
it: Il timecode risultante non è compreso nell'intervallo previsto di MaxValue.
ko: 결과 시간 코드가 MaxValue의 예상 범위를 벗어납니다.

# Smpte12M_2398_BadFormat
source: Timecode frame value is not in the expected range for SMPTE 23.98 IVTC.
es: El valor del fotograma de código de tiempo no está dentro del intervalo esperado para SMPTE a 23,98 IVTC.
fr: La valeur d'image de code horaire se trouve en dehors de l'intervalle attendu pour SMPTE 23.98 IVTC.
it: Il valore frame del timecode non è compreso nell'intervallo previsto per SMPTE 23.98 IVTC.
ko: 시간 코드 프레임 값이 SMPTE 23.98 IVTC의 예상 범위를 벗어납니다.

# Smpte12M_24_BadFormat
source: Timecode frame value is not in the expected range for SMPTE 24fps Film Sync.
es: El valor del fotograma de código de tiempo no está dentro del intervalo esperado para SMPTE a 24 fps Film Sync.
fr: La valeur d'image de code horaire se trouve en dehors de l'intervalle attendu pour SMPTE 24 ips Film Sync.
it: Il valore frame del timecode non è compreso nell'intervallo previsto per SMPTE 24fps Film Sync.
ko: 시간 코드 프레임 값이 SMPTE 24fps Film Sync의 예상 범위를 벗어납니다.

# Smpte12M_25_BadFormat
source: Timecode frame value is not in the expected range for SMPTE 25fps PAL.
es: El valor del fotograma de código de tiempo no está dentro del intervalo esperado para SMPTE a 25 fps PAL.
fr: La valeur d'image de code horaire se trouve en dehors de l'intervalle attendu pour SMPTE 25 ips PAL.
it: Il valore frame del timecode non è compreso nell'intervallo previsto per SMPTE 25fps PAL.
ko: 시간 코드 프레임 값이 SMPTE 25fps PAL의 예상 범위를 벗어납니다.

# Smpte12M_2997_Drop_BadFormat
source: Timecode frame value is not in the expected range for SMPTE 29.97 DropFrame.
es: El valor del fotograma de código de tiempo no está dentro del intervalo esperado para SMPTE a 29,97 DropFrame.
fr: La valeur d'image de code horaire se trouve en dehors de l'intervalle attendu pour SMPTE 29.97 DropFrame.
it: Il valore frame del timecode non è compreso nell'intervallo previsto per SMPTE 29.97 DropFrame.
ko: 시간 코드 프레임 값이 SMPTE 29.97 DropFram의 예상 범위를 벗어납니다.

# Smpte12M_2997_NonDrop_BadFormat
source: Timecode frame value is not in the expected range for SMTPE 29.97 NonDrop.
es: El valor del fotograma de código de tiempo no está dentro del intervalo esperado para SMTPE a 29,97 NonDrop.
fr: La valeur d'image de code horaire se trouve en dehors de l'intervalle attendu pour SMTPE 29.97 NonDrop.
it: Il valore frame del timecode non è compreso nell'intervallo previsto per SMTPE 29.97 NonDrop.
ko: 시간 코드 프레임 값이 SMTPE 29.97 NonDrop의 예상 범위를 벗어납니다.

# Smpte12M_30_BadFormat
source: Timecode frame value is not in the expected range for SMPTE 30fps.
es: El valor del fotograma de código de tiempo no está dentro del intervalo esperado para SMPTE a 30 fps.
fr: La valeur d'image de code horaire se trouve en dehors de l'intervalle attendu pour SMPTE 30 ips.
it: Il valore frame del timecode non è compreso nell'intervallo previsto per SMPTE 30fps.
ko: 시간 코드 프레임 값이 SMPTE 30fps의 예상 범위를 벗어납니다.

# tipChapters
source: Toggle chapters list (C)
es: Alternar lista de capítulos (C)
fr: Basculer vers la liste des chapitres (C)
it: Attiva/disattiva elenco capitoli (C)
ko: 챕터 목록 토글(C)

# tipClosedCaptions
source: Show/Hide closed captions (L)
es: Mostrar u ocultar subtítulos (L)
fr: Afficher/Masquer les sous-titres (L)
it: Mostra/nascondi didascalie chiuse (L)
ko: 선택 캡션 표시/숨기기(L)

# tipFullScreen
source: Toggle fullscreen playback (F)
es: Alternar reproducción a pantalla completa (F)
fr: Basculer vers la lecture plein écran (F)
it: Attiva/disattiva riproduzione a tutto schermo (S)
ko: 전체 화면 재생 토글(F)

# tipMute
source: Mute (M)
es: Silenciar (M)
fr: Muet (M)
it: Disattiva (D)
ko: 음소거(M)

# tipNextMarker
source: Next Marker (N)
es: Siguiente marcador (N)
fr: Prochain marqueur (N)
it: Segnaposto successivo (S)
ko: 다음 마커(N)

# tipOffline
source: Make player available offline (D)
es: Reproductor disponible sin conexión (D)
fr: Rendre le lecteur disponible hors connexion (D)
it: Rendi il lettore disponibile in modalità non in linea (D)
ko: 플레이어를 오프라인 사용 가능으로 설정(D)

# tipPlaylist
source: Toggle playlist (V)
es: Alternar lista de reproducción (V)
fr: Basculer vers la liste de lecture (V)
it: Attiva/disattiva playlist (V)
ko: 재생 목록 토글(V)

# tipPlayPause
source: Play/Pause (P)
es: Reproducir/Pausa (P)
fr: Lecture/Pause (P)
it: Riproduci/Pausa (P)
ko: 재생/일시 중지(P)

# tipPopout
source: Show player in seperate window (X)
es: Mostrar reproductor en una ventana independiente (X)
fr: Afficher le lecteur dans une fenêtre séparée (X)
it: Mostra lettore in una finestra separata (X)
ko: 별도의 창에 플레이어 표시(X)

# tipPreviousMarker
source: Previous Marker (B)
es: Marcador anterior (B)
fr: Marqueur précédent (B)
it: Segnaposto precedente (B)
ko: 이전 마커(B)

# tipSeekSlider
source: Seek to time
es: Buscar tiempo
fr: Rech. dans le temps
it: Tempo di ricerca
ko: 검색 속도

# tipStop
source: Stop (S)
es: Detener (S)
fr: Arrêter (A)
it: Arresta (S)
ko: 중지(S)

# tipVolumeDown
source: Decrease Volume (J)
es: Bajar volumen (J)
fr: Baisser le volume (J)
it: Diminuisci volume (J)
ko: 볼륨 낮춤(J)

# tipVolumeSlider
source: Volume Slider
es: Control deslizante de volumen
fr: Curseur du volume
it: Dispositivo di scorrimento volume
ko: 볼륨 슬라이더

# tipVolumeUp
source: Increase Volume (K)
es: Subir volumen (K)
fr: Monter le volume (K)
it: Aumenta volume (K)
ko: 볼륨 높임(K)

# tipFrameStepBackwards
source: Step backwards one frame (I)
es: Retroceder un fotograma (I)
fr: Reculer d'une image (I)
it: Torna indietro di un frame (I)
ko: 한 프레임씩 뒤로 이동(I)

# tipFrameStepForwards
source: Step forwards one frame (O)
es: Avanzar un fotograma (O)
fr: Avancer d'une image (O)
it: Avanza di un frame (O)
ko: 한 프레임씩 앞으로 이동(O)

# errorOfflineInterrupted
source: Offlining interrupted by network loss
es: Interrupción en el paso al modo sin conexión debido a la pérdida de la red
fr: Consultation hors connexion interrompue par une perte de réseau
it: Impostazione della modalità non linea interrotta da perdita del collegamento di rete
ko: 네트워크 손실로 인해 오프라인 전환 작업 중단

# errorInvalidPlaylist
source: Invalid Playlist
es: Lista de reproducción no válida
fr: Liste de lecture non valide
it: Playlist non valida
ko: 잘못된 재생 목록

# errorInvalidPlaylistNode
source: Invalid Playlist: Unexpected node: {0} in {1}
es: Lista de reproducción no válida: nodo inesperado: {0} en {1}
fr: Liste de lecture non valide : nœud inattendu : {0} dans {1}
it: Playlist non valida: Nodo non previsto: {0} in {1}
ko: 잘못된 재생 목록 {1}에 예기치 않은 노드 {0}이(가) 있습니다.

# errorValueOutOfRange
source: Expected value in range {0} to {1} found {2}
es: Se ha encontrado el valor esperado {2} en el intervalo de {0} a {1}
fr: Valeur attendue dans l'intervalle {0} à {1}, {2} trouvé
it: Vvalore previsto nell'intervallo da {0} a {1} trovato {2}
ko: {0}에서 {1} 사이의 값이 필요한데 {2}이(가) 있습니다.

# errorInvalidMedia
source: Could not open media file {0}
es: No se pudo abrir el archivo multimedia {0}
fr: Impossible d'ouvrir le fichier multimédia {0}
it: Impossibile aprire file multimediale {0}
ko: 미디어 파일 {0}을(를) 열 수 없습니다.

# readerChapters
source: Show chapters toggle
es: Alternar mostrar capítulos
fr: Afficher la bascule des chapitres
it: Attivazione/disattivazione visualizzazione capitoli
ko: 챕터 표시 토글

# readerClosedCaptions
source: Closed captions toggle
es: Alternar subtítulos
fr: Bascule des sous-titres
it: Attivazione/disattivazione didascalie chiuse
ko: 선택 캡션 토글

# readerFrameStepBackwards
source: Step backwards one frame
es: Retroceder un fotograma
fr: Reculer d'une image
it: Torna indietro di un frame
ko: 한 프레임씩 뒤로 이동

# readerFrameStepForwards
source: Step forwards one frame
es: Avanzar un fotograma
fr: Avancer d'une image
it: Avanza di un frame
ko: 한 프레임씩 앞으로 이동

# readerFullScreen
source: Full screen toggle
es: Alternar pantalla completa
fr: Bascule de plein écran
it: Attivazione/disattivazione schermo intero
ko: 전체 화면 토글

# readerMute
source: Mute Toggle
es: Alternar silencio
fr: Bascule Muet
it: Attivazione/disattivazione audio
ko: 음소거 토글

# readerNextMarker
source: Skip to next marker
es: Pasar al siguiente marcador
fr: Atteindre le prochain marqueur
it: Passa a segnaposto successivo
ko: 다음 마커로 건너뛰기

# readerOffline
source: Make player available offline
es: Reproductor disponible sin conexión
fr: Rendre le lecteur disponible hors connexion
it: Rendi il lettore disponibile in modalità non in linea
ko: 플레이어를 오프라인 사용 가능으로 설정

# readerPlaylist
source: Show playlist toggle
es: Alternar mostrar lista de reproducción
fr: Afficher la bascule de liste de lecture
it: Attivazione/disattivazione visualizzazione playlist
ko: 재생 목록 표시 토글

# readerPlayPause
source: Play pause toggle
es: Alternar reproducir y pausa
fr: Bascule de mise en pause
it: Attivazione/disattivazione riproduzione/pausa
ko: 재생 일시 중지 토글

# readerPopout
source: Show player in seperate window
es: Mostrar reproductor en una ventana independiente
fr: Afficher le lecteur dans une fenêtre séparée
it: Mostra lettore in una finestra separata
ko: 별도의 창에 플레이어 표시

# readerPreviousMarker
source: Skip to previous marker
es: Pasar al marcador anterior
fr: Atteindre le marqueur précédent
it: Passa a segnaposto precedente
ko: 이전 마커로 건너뛰기

# readerSeekSlider
source: Seek to time
es: Buscar tiempo
fr: Rech. dans le temps
it: Tempo di ricerca
ko: 검색 속도

# readerStop
source: Stop
es: Detener
fr: !YJnlu!§tõp !!
it: Arresta
ko: 중지

# readerVolumeDown
source: Decrease volume
es: Bajar volumen
fr: Baisser le volume
it: Riduci volume
ko: 볼륨 낮춤

# readerVolumeSlider
source: Set volume
es: Establecer volumen
fr: Régler le volume
it: Imposta volume
ko: 볼륨 설정

# readerVolumeUp
source: Increase volume
es: Subir volumen
fr: Monter le volume
it: Aumenta volume
ko: 볼륨 높임

# readerHour
source: one hour
es: una hora
fr: une heure
it: un'ora
ko: 1시간

# readerHours
source: {0} hours
es: {0} horas
fr: {0} heures
it: {0} ore
ko: {0}시간

# readerMinute
source: one minute
es: un minuto
fr: une minute
it: un minuto
ko: 1분

# readerMinutes
source: {0} minutes
es: {0} minutos
it: {0} minuti
ko: {0}분

# readerPlaylistItem
source: playlist item {0}. {1}.
es: elemento de la lista de reproducción {0}. {1}.
fr: élément de liste de lecture {0}. {1}.
it: voce playlist {0}. {1}.
ko: 재생 목록 항목 {0}. {1}.

# readerSecond
source: one second
es: un segundo
fr: une seconde
it: un secondo
ko: 1초

# readerSeconds
source: {0} seconds
es: {0} segundos
fr: {0} secondes
it: {0} secondi
ko: {0}초

# readerPlugIn
source: Show graphs
es: Mostrar gráficos
fr: Affich. graphiques
it: Mostra grafici
ko: 그래프 표시

# tipPlugIn
source: Show Graphs (G)
es: Mostrar gráficos (G)
fr: Aff. graphiques (G)
it: Mostra Grafici (G)
ko: 그래프 표시(G)

# textOfflineProgressPrompt
source: Downloading content for offline playback
es: Descargando contenido para la reproducción sin conexión
fr: Téléchargement de contenu pour la lecture hors ligne
it: Download del contenuto per la riproduzione non in linea
ko: 오프라인으로 재생할 콘텐츠를 다운로드하는 중

# buttonOfflineProgressFinish
source: Finish
es: Finalizar
fr: Terminer
it: Fine
ko: 완료

# tipOfflineProgressFinish
source: Click Finish to complete offline installation
es: Haga clic en Finalizar para completar la instalación sin conexión
fr: Cliquez sur Terminer pour terminer l'installation hors ligne
it: Fare clic su Fine per completare l'installazione non in linea
ko: [마침]을 클릭하여 오프라인 설치를 완료합니다.

# readerOfflineProgressFinish
source: Click the finish button to compete offline installation
es: Haga clic en el botón Finalizar para completar la instalación sin conexión
fr: Cliquez sur le bouton Terminer pour terminer l'installation hors ligne
it: Fare clic sul pulsante Fine per completare l'installazione non in linea
ko: [마침] 단추를 클릭하여 오프라인 설치를 완료합니다.

# buttonOfflineProgressCancel
source: Cancel
es: !iWqAR!Çæñ¢èl !!!
fr: !iWqAR!Çæñçèl !!!
it: !iWqAR!Cancel !!!
ko: !iWqAR!윜Cancel !!!

# tipOfflineProgressCancel
source: Click the cancel button to compete offline installation
es: Haga clic en el botón Cancelar para completar la instalación sin conexión
fr: Cliquez sur le bouton Annuler pour terminer l'installation hors ligne
it: Fare clic sul pulsante Annulla per completare l'installazione offline
ko: [취소] 단추를 클릭하여 오프라인 설치를 완료합니다.

# readerOfflineProgressCancel
source: Click the cancel button to stop offline installation
es: Haga clic en el botón Cancelar para detener la instalación sin conexión
fr: Cliquez sur le bouton Annuler pour arrêter l'installation hors ligne
it: Fare clic sul pulsante Annulla per interrompere l'installazione non linea
ko: [취소] 단추를 클릭하여 오프라인 설치를 중지합니다.

# textOfflineFinishPrompt
source: Click Finish to complete offline installation
es: Haga clic en Finalizar para completar la instalación sin conexión
fr: Cliquez sur Terminer pour terminer l'installation hors ligne
it: Fare clic su Fine per completare l'installazione non in linea
ko: [마침]을 클릭하여 오프라인 설치를 완료합니다.

# textOfflineProgressXOFYFormat
source: {0} of {1}
es: {0} de {1}
fr: {0} de {1}
it: {0} di {1}

# captionsCaptions
source: {0} captions
es: Títulos en {0}
fr: Légendes {0}
it: {0} didascalie
ko: {0} 캡션

# captionsDescriptive
source: {0} description
es: Descripción en {0}
it: Descrizione {0}
ko: {0} 설명

# captionsDownloading
source: Downloading captions {0}
es: Descargando títulos en {0}
fr: Téléchargement des légendes {0}
it: Download didascalie {0}
ko: {0} 캡션을 다운로드하는 중

# captionsSubtitles
source: {0} subtitles
es: Subtítulos en {0}
fr: Sous-titres {0}
it: {0} sottotitoli
ko: {0} 자막
